Revit 2027 API
RebarConstraint.GetTargetHostFaceReference Method
 Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. Will throw exception if it's a multi target constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetTargetHostFaceReference()
Public Function GetTargetHostFaceReference As Reference
public:
Reference^ GetTargetHostFaceReference()
member GetTargetHostFaceReference : unit -> Reference
Return Value
Reference
 Requested reference.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'. -or- Multi target constraint. Consider using the indexed version of the method.
See Also
Reference
RebarConstraint Class
GetTargetHostFaceReference Overload
Autodesk.Revit.DB.Structure Namespace